jiangalsoflow/ch32h417eye-track-use-ml/CH32H417/sdk_ch32h417/USBSS/HOST/HOST_SS_ACCESS_SECTOR/Common/ch32h417_enum.c
/********************************** (C) COPYRIGHT *******************************
* File Name          : ch32h417_enum.c
* Author             : WCH
* Version            : V1.0
* Date               : 2025/05/30
* Description        : This file provides the enumeration function of the host.
*********************************************************************************
* Copyright (c) 2025 Nanjing Qinheng Microelectronics Co., Ltd.
* Attention: This software (modified or not) and binary are used for
* microcontroller manufactured by Nanjing Qinheng Microelectronics.
*******************************************************************************/
#include <string.h>
#include <stdio.h>
#include "ch32h417_usbss_host.h"
#include "ch32h417_enum.h"
#include "ch32h417_udisk.h"

/* Constant, variable, structure definition */
USB_SETUP_REQ *Ctl_Setup;	  													/* Control the transmission data packet */
uint8_t   gDeviceClassType;														/* Current device type */
volatile uint8_t   gDeviceConnectstatus;													/* USB connection status */
uint8_t   gDeviceUsbType = 0;												    /* USB connection status：0x01--USB2.0&1.1  0x02--USB3.0 */
uint8_t   gUdisk_flag = 0;
#define	  DEVICE_ADDR				0x08										/* Device address of USB30 */

#define DEF_WAIT_USB_TOUT_200US     1000
#define DEF_CTRL_TRANS_TIMEOVER_CNT 60000                						/* Control transmission delay timing */

extern __attribute__((aligned(4))) uint8_t  RxBuffer[ 64 ];     				/* IN, must even address */
extern __attribute__((aligned(4))) uint8_t  TxBuffer[ 64 ];     				/* OUT, must even address */

uint8_t UsbDevEndp0Size = 8;

/*********************************************************************
 * @fn      U30HostCtrlTransfer
 *
 * @brief   USB3.0 host control transfer function
 *
 * @param   ReqBuf  - Request buffer
 *		    DatBuf  - Data buffer
 *		    RetLen  - Length
 *
 * @return  Status 
 */
uint8_t U30HostCtrlTransfer( PUINT8 ReqBuf, PUINT8 DatBuf, PUINT16 RetLen )  		// ReqBuf points to an 8-byte request code, and DatBuf is the send and receive buffer
{
	uint16_t total, wait_erdy, temp;
	uint32_t timeout;

	memcpy( USBSS_EP0_Tx_Buf, ReqBuf, 8 );
	USBSSH->UH_TX_DMA = (uint32_t)USBSS_EP0_Tx_Buf;                     			// Set tx dma address
    USBSSH->UH_RX_DMA = (uint32_t)USBSS_EP0_Rx_Buf;                     			// Set rx dma address
    USBSSH->HOST_TX_NUMP = 1;
    USBSSH->UH_TX_CTRL = UH_TX_SETUP | UH_RTX_VALID | (1<<24) | 8; 					// Tx SETUP
	timeout = 0;
	wait_erdy = 0;

	/* Setup Stage */
	while(1)
	{					
		if( gDeviceConnectstatus == USB_INT_DISCONNECT ) return USB_INT_DISCONNECT;
		if( USBSSH->UH_TX_CTRL & UH_INT_FLAG )
		{
			if( (USBSSH->USB_STATUS & USB_TX_RES_MASK) == TX_RES_ACK )
			{
				USBSSH->UH_TX_CTRL = 0x0;
				if( (((USBSSH->USB_STATUS) >>16) & 0x1f) == 0 )						// Wait for the USB device ERDY
				{					
					wait_erdy = 1;
				}
				else{
					break;															// Normal. Exit directly
				}
			}
		    else if( (USBSSH->USB_STATUS & USB_TX_RES_MASK) == TX_RES_FAILED )
            {
                USBSSH->UH_TX_CTRL = UH_TX_SETUP | UH_RTX_VALID | (1<<24) | 8; 		// Tx SETUP
            }
		}		
		if( USBSSH->USB_STATUS & USB_ERDY_FLAG )									// Wait until the host receives ERDY and exits
		{									
			wait_erdy = 0;
			if( !(USBSSH->UH_TX_CTRL & UH_RTX_VALID ) )
			{		
				USBSSH->UH_TX_CTRL |=  UH_RTX_VALID;
			}
			USBSSH->USB_STATUS = USB_ERDY_FLAG;
			break;
		}
		timeout++;
		if( timeout > 0xfffffff )	return USB_CH417USBTIMEOUT;
	}	

	/* Data Stage */
	total = *( ReqBuf + 6 );
	if( total && DatBuf ) 
	{
		timeout = 0;
		wait_erdy = 0;
		if( *ReqBuf & 0x80 ) 														// Read data
		{  	
			USBSSH->HOST_RX_NUMP = 1;												// Setup  A packet of data
			USBSSH->UH_RX_CTRL = 0 << 16 | UH_RTX_VALID | 1<<24 | 0 <<12; 			// 0<<16 Synchronization flag，1<<24 Sudden number of brust，0 <<12 Endpoint number

			while(1)
			{
				if( gDeviceConnectstatus == USB_INT_DISCONNECT )	return USB_INT_DISCONNECT;

				if(USBSSH->UH_RX_CTRL & UH_INT_FLAG)
				{
					USBSSH->UH_RX_CTRL &= ~UH_INT_FLAG;
					if( (USBSSH->USB_STATUS & USB_RX_RES_MASK) == RX_RES_ACK )
					{
						USBSSH->UH_RX_CTRL = 0x0;										// Suspend data reception
						USBSSH->USB_STATUS = USB_ACT_FLAG;								// Clear the USB interrupt register
						temp = USBSSH->UH_RX_CTRL & 0x7ff;								// The length of the read data is 0 to 10 bytes
						*RetLen = USBSSH->UH_RX_CTRL & 0x7ff;				
						memcpy( DatBuf, USBSS_EP0_Rx_Buf, temp );						// Read the returned data
						break;															// Normal data, exit directly

					}
					else if( (USBSSH->USB_STATUS & USB_RX_RES_MASK) == RX_RES_NRDY )	// The device has not returned to the ERDY state and is waiting for the ERADY state
					{
						USBSSH->UH_RX_CTRL = 0x0;
					}
					else if( (USBSSH->USB_STATUS & USB_RX_RES_MASK) == RX_RES_STALL ){	//STALL
						USBSSH->UH_RX_CTRL = 0x00;		// Clear the interrupt status
						return USB_INT_DISK_ERR;
					}
					else								// Other Errors
					{
						USBSSH->UH_RX_CTRL = 0x00;		// Clear the interrupt status					
					}
				}	
				else if( (USBSSH->USB_STATUS & USB_ERDY_FLAG) )							//The USB device is in ERDY status
				{
					USBSSH->UH_RX_CTRL = 0 << 16 | UH_RTX_VALID | 1<<24 | 0 <<12; 		// ACK-TP(IN)
					USBSSH->USB_STATUS = USB_ERDY_FLAG;
				}
				if( gDeviceConnectstatus == USB_INT_DISCONNECT )	return USB_INT_DISCONNECT;
			}
		}		
		else												// Send data
		{					
			if( total )
			{
				wait_erdy =0;
				timeout=0;
				memcpy( USBSS_EP0_Tx_Buf, DatBuf, *RetLen );	
				
				USBSSH->HOST_TX_NUMP = 1;
    			USBSSH->UH_TX_CTRL = 0 <<16 | UH_RTX_VALID | 1<<24 | 0 <<12 | *RetLen;										// Seq_num --- 0 ，Burst_nump -- 1，Endp -- 0
				while(1)
				{
					if( gDeviceConnectstatus == USB_INT_DISCONNECT )	return USB_INT_DISCONNECT;
					if( USBSSH->UH_TX_CTRL & UH_INT_FLAG ) 
					{
						if( (USBSSH->USB_STATUS & USB_TX_RES_MASK) == TX_RES_ACK )
						{
							USBSSH->UH_TX_CTRL = 0x0;
							{
								break;
							}
						}
						else if( (USBSSH->USB_STATUS & USB_RX_RES_MASK) == TX_RES_NRDY )
						{
							USBSSH->UH_TX_CTRL = 0x0;
							USBSSH->USB_STATUS = USB_ACT_FLAG;
						}
						else if( (USBSSH->USB_STATUS & USB_TX_RES_MASK) == TX_RES_STALL )
						{
							USBSSH->UH_TX_CTRL = 0x0;
							return USB_INT_DISK_ERR;
						}
						else if( (USBSSH->USB_STATUS & USB_TX_RES_MASK) == TX_RES_FAILED )
						{
							USBSSH->UH_TX_CTRL = USBSSH->UH_TX_CTRL = 0 <<16 | UH_RTX_VALID | 1<<24 | 0 <<12 | *RetLen;		// Seq_num --- 0 , Burst_nump -- 1, endp -- 0
						}
						else
						{
							USBSSH->UH_TX_CTRL = 0x0;
							return USB_INT_DISK_ERR;
						}
					}
					else if( (USBSSH->USB_STATUS & USB_ERDY_FLAG)  )
					{
						if( !(USBSSH->UH_TX_CTRL & UH_RTX_VALID ))
						{
							USBSSH->UH_TX_CTRL = USBSSH->UH_TX_CTRL = 0 <<16 | UH_RTX_VALID | 1<<24 | 0 <<12 | *RetLen;
						}
						USBSSH->USB_STATUS = USB_ERDY_FLAG;
					}
					if( wait_erdy ){			
						if( USBSSH->USB_STATUS & USB_ERDY_FLAG )
						{															// Wait until the host receives ERDY and exits
							wait_erdy = 0;
							USBSSH->USB_STATUS = USB_ERDY_FLAG;
							break;
						}
					}
					if( gDeviceConnectstatus == USB_INT_DISCONNECT )	return USB_INT_DISCONNECT;
					timeout++;
					if( timeout > 0xfffff )	return USB_CH417USBTIMEOUT;
				}
			}	
		}
	}
	Delay_Ms(1);																											// This delay function is required，otherwise the STATUS package cannot be transmitted 
	timeout = 0;
    USBSSH->HOST_TX_NUMP = 1;
    USBSSH->UH_TX_CTRL = UH_TX_STATUS | UH_RTX_VALID;																		// Tx status-TP
	while( 1 ) 																												// Wait STATUS-TP complete
	{
		if( gDeviceConnectstatus == USB_INT_DISCONNECT )	return USB_INT_DISCONNECT;
		if( USBSSH->UH_TX_CTRL & UH_INT_FLAG  ) 
		{
			if( (USBSSH->USB_STATUS & USB_TX_RES_MASK) == TX_RES_ACK )
			{
				USBSSH->UH_TX_CTRL = 0x0;
				USBSSH->USB_STATUS = USB_ACT_FLAG;
				break;
			}
			else if( (USBSSH->USB_STATUS & USB_TX_RES_MASK) == TX_RES_NRDY )
			{
				USBSSH->UH_TX_CTRL = 0x0;
                while( !(USBSSH->USB_STATUS & USB_ERDY_FLAG) );
                USBSSH->USB_STATUS = USB_ERDY_FLAG;
                USBSSH->UH_TX_CTRL = UH_TX_STATUS | UH_RTX_VALID;															// Tx status-TP
			}
			else if( (USBSSH->USB_STATUS & USB_TX_RES_MASK) == TX_RES_STALL )
			{
				USBSSH->UH_TX_CTRL = 0x0;
				USBSSH->USB_STATUS = USB_ACT_FLAG;
				return USB_INT_DISK_ERR;
			}
			else
			{
				USBSSH->USB_STATUS = USB_ACT_FLAG;
			}
		}
		if( gDeviceConnectstatus == USB_INT_DISCONNECT )	return USB_INT_DISCONNECT;
		timeout++;
		if( timeout > 0xfffff )	return USB_CH417USBTIMEOUT;
	}
	return USB_INT_SUCCESS;
}

/*********************************************************************
 * @fn      U30OST_GetDeviceDescr
 *
 * @brief   The USB host obtains the device descriptor
 *
 * @param   *buf  - Data buffer
 *		   *len  - Data length
 *
 * @return  Status 
 */
uint8_t U30OST_GetDeviceDescr( uint8_t *buf ,uint16_t *len )
{
	uint16_t l;
	uint8_t  status;
	uint8_t  Setup_buf[8];

	Setup_buf[0] = 0x80;
	Setup_buf[1] = 0x06;
	Setup_buf[2]  = 0x00;
	Setup_buf[3]  = 0x01;
	Setup_buf[4]  = 0x00;
	Setup_buf[5]  = 0x00;
	Setup_buf[6] = *len;
	Setup_buf[7] = 0x00;
	l = *len;

	status = U30HostCtrlTransfer( Setup_buf, buf, &l );
	if( status == USB_INT_SUCCESS )
	{
		*len = l;
	}
	return status;
}

/*********************************************************************
 * @fn      U30HOST_GetConfigDescr
 *
 * @brief   The USB host obtains the configuration descriptor
 *
 * @param   *buf  - Data buffer
 *		   *len  - Data length
 *
 * @return  Status 
 */
uint8_t U30HOST_GetConfigDescr( uint8_t *buf ,uint16_t *len )
{
	uint16_t l;
	uint8_t  status;
	uint8_t  Setup_buf[8];

	Setup_buf[0] = 0x80;
	Setup_buf[1] = 0x06;
	Setup_buf[2] = 0x00;
	Setup_buf[3] = 0x02;
	Setup_buf[4] = 0x00;
	Setup_buf[5] = 0x00;
	Setup_buf[6] = 0x40;
	Setup_buf[7] = 0x00;
	l = 0x40;
	status = U30HostCtrlTransfer( Setup_buf, buf, &l );

	if( status == USB_INT_SUCCESS ){
		Setup_buf[6] = (( (PUSB_CFG_DESCR)buf ) -> wTotalLength)&0xff;
		Setup_buf[7] = (( (PUSB_CFG_DESCR)buf ) -> wTotalLength)>>8;
		l = Ctl_Setup->wLength;
		status = U30HostCtrlTransfer( Setup_buf, buf, &l );
		if( status == USB_INT_SUCCESS )
		{
			*len = l;
		}
		else
		{
			*len = 0x00;
		}
	}
	return status;
}

/*********************************************************************
 * @fn      U30HOST_GetBosDescr
 *
 * @brief   The USB host obtains the BOS descriptor
 *
 * @param   *buf  - Data buffer
 *		   *len  - Data length
 *
 * @return  Status 
 */
uint8_t U30HOST_GetBosDescr( uint8_t *buf ,uint16_t *len )
{
	uint16_t l;
	uint8_t  status;
	uint8_t  Setup_buf[8];

	Setup_buf[0] = 0x80;
	Setup_buf[1] = 0x06;
	Setup_buf[2] = 0x00;
	Setup_buf[3] = 0x0F;
	Setup_buf[4] = 0x00;
	Setup_buf[5] = 0x00;
	Setup_buf[6] = 0xFF;
	Setup_buf[7] = 0x00;
	l = 0xFF;

	status = U30HostCtrlTransfer( Setup_buf, buf, &l );
	if( status == USB_INT_SUCCESS )
	{
		*len = l;
	}
	return status;
}

/*********************************************************************
 * @fn      U30HOST_SetInterface
 *
 * @brief   The USB host Set Interface
 *
 * @param   inf  - Interface
 *
 * @return  Status 
 */
uint8_t U30HOST_SetInterface( uint8_t inf )
{
	uint8_t  status;
	uint8_t  Setup_buf[8];

	Setup_buf[0] = 0x01;
	Setup_buf[1] = 0x0b;
	Setup_buf[2] = inf;
	Setup_buf[3] = 0x00;
	Setup_buf[4] = 0x00;
	Setup_buf[5] = 0x00;
	Setup_buf[6] = 0x00;
	Setup_buf[7] = 0x00;

	status = U30HostCtrlTransfer( Setup_buf, NULL, NULL );
	if( status == USB_INT_SUCCESS ){
	}
	return status;
}

/*********************************************************************
 * @fn      U30HOST_SetIsochDelay
 *
 * @brief   Set the synchronization delay for the USB host
 *
 * @param   none
 *
 * @return  Status 
 */
uint8_t U30HOST_SetIsochDelay( void )
{
	uint8_t status;
	uint8_t Setup_buf[8];

	Setup_buf[0] = 0x00;
	Setup_buf[1] = 0x31;
	Setup_buf[2] = 0xff;
	Setup_buf[3] = 0x00;
	Setup_buf[4] = 0x00;
	Setup_buf[5] = 0x00;
	Setup_buf[6] = 0x00;
	Setup_buf[7] = 0x00;

	status = U30HostCtrlTransfer( Setup_buf, NULL, NULL );
	if( status == USB_INT_SUCCESS )
	{
		USBSSH->LINK_ISO_DLY = 0xff;
	}
	return status;
}

/*********************************************************************
 * @fn      U30HOST_SetSel
 *
 * @brief   The USB3.0 Host Set Sel 
 *
 * @param   buf  - Data buffer
 *          len  - Data length
 *
 * @return  Current  Status 
 */
uint8_t U30HOST_SetSel( uint8_t *buf ,uint16_t *len )
{
	uint8_t status;
	uint8_t Setup_buf[8];

	Setup_buf[0] = 0x00;
	Setup_buf[1] = 0x30;
	Setup_buf[2] = 0x00;
	Setup_buf[3] = 0x00;
	Setup_buf[4] = 0x00;
	Setup_buf[5] = 0x00;
	Setup_buf[6] = 0x06;
	Setup_buf[7] = 0x00;

	status = U30HostCtrlTransfer( Setup_buf, buf, len );
	if( status == USB_INT_SUCCESS ){
	}
	return status;
}

/*********************************************************************
 * @fn      U30HOST_SetFeatureU1
 *
 * @brief   The USB3.0 Host Set FeatureU1
 *
 * @param   none
 *
 * @return  Current  Status 
 */
uint8_t U30HOST_SetFeatureU1( void )
{
	uint8_t  status;
	uint8_t  Setup_buf[8];

	Setup_buf[0] = 0x00;
	Setup_buf[1] = 0x03;
	Setup_buf[2]  = 0x30;
	Setup_buf[3]  = 0x00;
	Setup_buf[4]  = 0x00;
	Setup_buf[5]  = 0x00;
	Setup_buf[6] = 0x00;
	Setup_buf[7] = 0x00;

	status = U30HostCtrlTransfer( Setup_buf, NULL, NULL );
	if( status == USB_INT_SUCCESS ){
	}
	return status;
}

/*********************************************************************
 * @fn      U30HOST_SetFeatureU2
 *
 * @brief   The USB3.0 Host Set FeatureU2
 *
 * @param   none
 *
 * @return  Status 
 */
uint8_t U30HOST_SetFeatureU2( void )
{
	uint8_t  status;
	uint8_t  Setup_buf[8];

	Setup_buf[0] = 0x00;
	Setup_buf[1] = 0x03;
	Setup_buf[2] = 0x31;
	Setup_buf[3] = 0x00;
	Setup_buf[4] = 0x00;
	Setup_buf[5] = 0x00;
	Setup_buf[6] = 0x00;
	Setup_buf[7] = 0x00;

