jiangalsoflow/ch32h417eye-track-use-ml/CH32H417/sdk_ch32h417/USBSS/HOST/HOST_SS_ACCESS_SECTOR/Common/ch32h417_enum.c
	status = U30HostCtrlTransfer( Setup_buf,NULL,NULL );
	if( status == USB_INT_SUCCESS ){
	}
	return status;
}

/*********************************************************************
 * @fn      U30HOST_SetAddress
 *
 * @brief   The USB3.0 Host Set FeatureU2
 *
 * @param   addr  - Address value
 *
 * @return  Status 
 */
uint8_t U30HOST_SetAddress( uint8_t addr )
{
	uint8_t status;
	uint8_t Setup_buf[8];

	Setup_buf[0] = 0X00;
	Setup_buf[1] = 0x05;
	Setup_buf[2] = addr;
	Setup_buf[3] = 0x00;
	Setup_buf[4] = 0x00;
	Setup_buf[5] = 0x00;
	Setup_buf[6] = 0x00;
	Setup_buf[7] = 0x00;

	/* Set the address of the USB device */
	status = U30HostCtrlTransfer( Setup_buf, NULL, NULL );
	if( status == USB_INT_SUCCESS )
	{
		USBSSH->USB_CONTROL &= 0x00ffffff;
		USBSSH->USB_CONTROL |= addr<<24; 										// SET ADDRESS
	}
	mDelaymS( 5 );  											  				// Wait for the USB device to complete the operation
	return status;
}

/*********************************************************************
 * @fn      U30HOST_SetConfig
 *
 * @brief   USB host Settings configuration values
 *
 * @param   cfg  - Configuration value
 *
 * @return  Status 
 */
uint8_t U30HOST_SetConfig( uint8_t cfg )
{
	uint8_t status;
	uint8_t Setup_buf[8];

	Setup_buf[0] = 0x00;
	Setup_buf[1] = 0x09;
	Setup_buf[2] = cfg;
	Setup_buf[3] = 0x00;
	Setup_buf[4] = 0x00;
	Setup_buf[5] = 0x00;
	Setup_buf[6] = 0x00;
	Setup_buf[7] = 0x00;

	/* USB host Settings configuration values */
	status = U30HostCtrlTransfer( Setup_buf, NULL, NULL );
	return status;
}

/*********************************************************************
 * @fn      U30HOST_ClearEndpStall
 *
 * @brief   USB host clear endpoint
 *
 * @param   endp  - Endpoint number
 *
 * @return  Status 
 */
uint8_t U30HOST_ClearEndpStall( uint8_t endp )
{
	uint8_t  status;
	uint8_t  Setup_buf[8];

	Setup_buf[0] = 0x02;
	Setup_buf[1] = 0x01;
	Setup_buf[2] = 0X00;
	Setup_buf[3] = 0x00;
	Setup_buf[4] = endp;
	Setup_buf[5] = 0x00;
	Setup_buf[6] = 0x00;
	Setup_buf[7] = 0x00;

	status = U30HostCtrlTransfer( Setup_buf, NULL, NULL  );	
	return status;
}

/*********************************************************************
 * @fn      U30HOST_CofDescrAnalyse
 *
 * @brief   USB host analysis configuration descriptor
 *
 * @param   pbuf  - Data buffer
 *
 * @return  Status 
 */
uint8_t U30HOST_CofDescrAnalyse( uint8_t *pbuf )
{
	gDeviceClassType = ( (PUSB_CFG_DESCR_LONG_U30)pbuf ) -> itf_descr.bInterfaceClass;
	if( ( gDeviceClassType <= 0x09 ) || ( gDeviceClassType == 0xFF ) )
	{
		return USB_INT_SUCCESS;
	}
	else
	{
		gDeviceClassType = USB_DEV_CLASS_RESERVED;								// The current device type is unknown by default
		return ERR_USB_UNKNOWN;  									 	    // Not supported， Return
	}
}

/*********************************************************************
 * @fn      U30HSOT_Enumerate
 *
 * @brief   USB30 host enumeration operation
 *
 * @param   pbuf  - Data buffer
 *
 * @return  Status
 */
uint8_t U30HSOT_Enumerate( uint8_t *pbuf )
{
	uint8_t status;
	uint16_t len,i;
	uint8_t cfg;
//	mDelaymS( 1000 );       													// There is a necessary delay. When encountering some USB drives, the device descriptor cannot be obtained without delay

/* Sets Address */
	printf("start_enmu\n");
    USBSSH->USB_CONTROL &= 0x00ffffff;
    USBSSH->USB_CONTROL |= 0<<24; 												// SET ADDRESS                                         

    mDelaymS(1);
	status = U30HOST_SetAddress( DEVICE_ADDR );									// U30 first sets the address and then obtains the device descriptor
	printf("set_addr=%02x\n",status);
	if( status != USB_INT_SUCCESS ){
		printf("SetAddr_ERROR=%02x\n",status);
		return status;
	}
	mDelaymS(10);

/* Get Device Descriptor */
	printf("get_dev:\n");
	len = 0x12;
	status = U30OST_GetDeviceDescr( pbuf, &len );								// Get The Device Descriptor
	if( status != USB_INT_SUCCESS ){
		printf("GetDev_ERROR=%02x\n",status);
		return USB_OPERATE_ERROR;
	}
	printf("DeviceDescr:");
	for( i=0;i!=len;i++ ){
		printf("%02x ",*(pbuf+i));
	}
	printf("\n");
	mDelaymS( 100 );			

/* Get Configuration Descriptor */
	len = 0;
	status = U30HOST_GetConfigDescr( pbuf,&len );								// Get The Configuration Descriptor
	if( status != USB_INT_SUCCESS ){
		printf("GetConfig_ERROR=%02x\n",status);
		return USB_OPERATE_ERROR;
	}
	cfg = ( (PUSB_CFG_DESCR)pbuf ) -> bConfigurationValue;
	printf("cfg=%02x\n",cfg);
	printf("ConfigDescr:");
	for( i=0;i!=len;i++ ){
		printf("%02x ",*(pbuf+i));
	}
	printf("\n");

/* Analyze Configuration Descriptor */
	status = U30HOST_CofDescrAnalyse( pbuf );									// Analyze The Configuration Descriptor
	if( status != USB_INT_SUCCESS )
	{
		printf( "Current Device is Not USB Mass Storage Device\n" );
		return( USB_OPERATE_ERROR ); 		 									// Return directly
	}
	status = U30HOST_MS_CofDescrAnalyse( pbuf );
	printf("status-1=%02x\n",status);
	status = U30HOST_GetBosDescr( pbuf,&len );
	if( status != USB_INT_SUCCESS )
	{
		printf( "GetBos_ERROR=%02x\n",status );
		return( USB_OPERATE_ERROR ); 		 									// Return directly
	}
	status = U30HOST_SetIsochDelay();											// Maybe Removed because some USB drives do not support it, nor does ADATA Drive
	printf("SetIsochDelay=%02x\n",status);
	if( status != USB_INT_SUCCESS )
	{
		if( status != 0x1f ){
			printf( "SetIsochDelay_ERROR=%02x\n",status );
			return( USB_OPERATE_ERROR ); 		 								// Return directly
		}
	}

/* Settings Configuration */
	status = U30HOST_SetConfig( cfg ); 											// Set The USB Device Configuration
	if ( status != USB_INT_SUCCESS )
	{
		printf( "SetConfig_ERROR = %02X\n", (UINT16)status );
		return( USB_OPERATE_ERROR ); 		 									// Return directly 
	}

#if 0
	status = U30HOST_SetFeatureU1();
	if ( status != USB_INT_SUCCESS )
	{
		printf( "SetFeatureU1_ERROR = %02X\n", (UINT16)status );
		return( USB_OPERATE_ERROR ); 		 									// Return directly
	}

	status = U30HOST_SetFeatureU2();
	if ( status != USB_INT_SUCCESS )
	{
		printf( "SetFeatureU2_ERROR = %02X\n", (UINT16)status );
		return( USB_OPERATE_ERROR ); 		 									// Return directly
	}
#endif

	return USB_OPERATE_SUCCESS;
}

/*********************************************************************
 * @fn      U30HSOT_Enumerate_Hotrst
 *
 * @brief   USB30 host Enumeration Operation.
 *
 * @param   pbuf  - Data buffer.
 *
 * @return  Status.
 */
uint8_t U30HSOT_Enumerate_Hotrst( uint8_t *pbuf )
{
    uint8_t status;
    uint16_t len;
    uint8_t cfg;

    USBSSH->USB_CONTROL &= 0x00ffffff;
    USBSSH->USB_CONTROL |= 0<<24; 						// Set address                                          

    mDelaymS(1);
    status = U30HOST_SetAddress( DEVICE_ADDR );         // Set the address first and then obtain the device descriptor
    if( status != USB_INT_SUCCESS ){
        printf("SetAddr_ERROR=%02x\n",status);
    	return status;
    }
    len = 0x12;
    status = U30OST_GetDeviceDescr( pbuf,&len );		// Obtain the device descriptor
    if( status != USB_INT_SUCCESS ){
        return USB_OPERATE_ERROR;
    }
    mDelaymS( 20 );
    len = 0;
    status = U30HOST_GetConfigDescr( pbuf,&len );		// Obtain the configuration descriptor
    if( status != USB_INT_SUCCESS ){

