jiangalsoflow/ch32h417eye-track-use-ml/CH32H417/sdk_ch32h417/USBSS/HOST/HOST_SS_ACCESS_SECTOR/Common/ch32h417_enum.c
    if( USBHSH->RX_LEN == 0 )
    {
        return ERR_SUCCESS;    //status stage is in, a zero-length packet is returned indicating success.
    }

    return ERR_USB_BUF_OVER;
}

/*********************************************************************
 * @fn      U20HOST_GetDeviceDescr
 *
 * @brief   The USB Host Get the device descriptor
 *
 * @param   buf  - Data buffer
 *          len  - Data Length
 *
 * @return  Status.
 */
uint8_t U20HOST_GetDeviceDescr( uint8_t *buf ,uint16_t *len )
{
	uint8_t l;
	uint8_t status;
	uint8_t Setup_buf[8];
	l = *len;

	Setup_buf[0] = 0x80;
	Setup_buf[1] = 0x06;
	Setup_buf[2] = 0x00;
	Setup_buf[3] = 0x01;
	Setup_buf[4] = 0x00;
	Setup_buf[5] = 0x00;
	Setup_buf[6] = (uint8_t)l;
	Setup_buf[7] = 0x00;

	status = U20HostCtrlTransfer( Setup_buf,buf, &l );
	if( status == USB_INT_SUCCESS ){
		*len = l;
		UsbDevEndp0Size = *(buf+7);
	}
	return status;
}

/*********************************************************************
 * @fn      U20HOST_GetConfigDescr
 *
 * @brief   The USB Host Get the configuration descriptor
 *
 * @param   buf  - Data buffer
 *          len  - Data Length
 *
 * @return  Status.
 */
uint8_t U20HOST_GetConfigDescr( uint8_t *buf ,uint16_t *len )
{
	uint8_t l;
	uint8_t status;
	uint8_t Setup_buf[8];

	Setup_buf[0] = 0x80;
	Setup_buf[1] = 0x06;
	Setup_buf[2] = 0x00;
	Setup_buf[3] = 0x02;
	Setup_buf[4] = 0x00;
	Setup_buf[5] = 0x00;
	Setup_buf[6] = 0x40;
	Setup_buf[7] = 0x00;
	l = 0x40;

	status = U20HostCtrlTransfer( Setup_buf, buf, &l );
	if( status == USB_INT_SUCCESS ){
		Setup_buf[6] = (( (PUSB_CFG_DESCR)buf ) -> wTotalLength)&0xff;
		Setup_buf[7] = (( (PUSB_CFG_DESCR)buf ) -> wTotalLength)>>8;

		l = Ctl_Setup->wLength;
		status = U20HostCtrlTransfer( Setup_buf,buf, &l );
		if( status == USB_INT_SUCCESS )
		{
			*len = l;
		}
		else
		{
			*len = 0x00;
		}
	}
	return status;
}

/*********************************************************************
 * @fn      U20HOST_SetAddress
 *
 * @brief   USB20 Host Set Address
 *
 * @param   addr  - Address
 *
 * @return  Status.
 */
uint8_t U20HOST_SetAddress( uint8_t addr )
{
	uint8_t status;
	uint8_t Setup_buf[8];

	Setup_buf[0] = 0X00;
	Setup_buf[1] = 0x05;
	Setup_buf[2] = addr;
	Setup_buf[3] = 0x00;
	Setup_buf[4] = 0x00;
	Setup_buf[5] = 0x00;
	Setup_buf[6] = 0x00;
	Setup_buf[7] = 0x00;

	status = U20HostCtrlTransfer( Setup_buf ,NULL, NULL );
	if( status == USB_INT_SUCCESS )
	{
	    USBHSH->DEV_ADDR = addr;                               // 设置USB主机当前操作的USB设备地址
	    mDelaymS( 10 );                                        // 等待USB设备完成操作
	}
	mDelaymS( 5 );  										
	return( status );
}

/*********************************************************************
 * @fn      U20HOST_SetConfig
 *
 * @brief   USB20 Host Set the configuration value
 *
 * @param   cfg  - Configuration value
 *
 * @return  Status.
 */
uint8_t U20HOST_SetConfig( uint8_t cfg )
{
	uint8_t status;
	uint8_t Setup_buf[8];

	Setup_buf[0] = 0x00;
	Setup_buf[1] = 0x09;
	Setup_buf[2] = cfg;
	Setup_buf[3] = 0x00;
	Setup_buf[4] = 0x00;
	Setup_buf[5] = 0x00;
	Setup_buf[6] = 0x00;
	Setup_buf[7] = 0x00;

	status = U20HostCtrlTransfer( Setup_buf, NULL, NULL );
	return( status );
}

/*********************************************************************
 * @fn      U20HOST_ClearEndpStall
 *
 * @brief   USB Host clear endpoint
 *
 * @param   endp  - Endpoint number 
 *
 * @return  Status.
 */
uint8_t U20HOST_ClearEndpStall( uint8_t endp )
{
	uint8_t status;
	uint8_t Setup_buf[8];

	Setup_buf[0] = 0x02;
	Setup_buf[1] = 0x01;
	Setup_buf[2] = 0X00;
	Setup_buf[3] = 0x00;
	Setup_buf[4] = endp;
	Setup_buf[5] = 0x00;
	Setup_buf[6] = 0x00;
	Setup_buf[7] = 0x00;

	status = U20HostCtrlTransfer( Setup_buf, NULL, NULL  );
	return( status );
}

/*********************************************************************
 * @fn      U20HOST_CofDescrAnalyse
 *
 * @brief   USB host analysis configuration descriptor
 *
 * @param   pbuf  - Descriptor buffer
 *
 * @return  Status.
 */
uint8_t U20HOST_CofDescrAnalyse( uint8_t *pbuf )
{
	gDeviceClassType = ( (PUSB_CFG_DESCR_LONG)pbuf ) -> itf_descr.bInterfaceClass;
	if( ( gDeviceClassType <= 0x09 ) || ( gDeviceClassType == 0xFF ) )
	{
		return( USB_INT_SUCCESS );
	}
	else
	{
		gDeviceClassType = USB_DEV_CLASS_RESERVED;								
		return( ERR_USB_UNKNOWN );  									 	    
	}
}

/*********************************************************************
 * @fn      U20HSOT_Enumerate
 *
 * @brief   USB20 Host enumerate function
 *
 * @param   pbuf  - Data buffer
 *
 * @return  Status.
 */
uint8_t U20HSOT_Enumerate( uint8_t *pbuf )
{
	uint8_t status;
	uint8_t cfg,i;
	uint16_t len;

	USBHSH->PORT_STATUS_CHG = 0xff;
	USBHSH->PORT_CTRL |= USBHS_UH_SET_PORT_RESET;     																   // Bus Reset
	USBHSH->CFG |= USBHS_UH_SOF_EN;

	while(1){																										   // Recheck the device attach
		if(USBHSH->PORT_STATUS_CHG & USBHS_UHIF_PORT_RESET){      													   // Wait Bus Reset     
			if( (USBHSH->PORT_STATUS & USBHS_UHIS_PORT_CONNECT) && ( USBHSH->PORT_STATUS & USBHS_UHIS_PORT_EN ) ) {    // Device Attach
				printf("PORT_STATUS_CHG = %02x, PORT_STATUS = %02x\n", USBHSH->PORT_STATUS_CHG, USBHSH->PORT_STATUS);
				USBHSH->PORT_STATUS_CHG = USBHS_UHIF_PORT_RESET;													   // Clear Port Status
				printf("USBHSH->PORT_STATUS_CHG = %02x, PORT_STATUS = %02x\n", USBHSH->PORT_STATUS_CHG, USBHSH->PORT_STATUS);
				break;
			}
		}
		else{
			if( (USBHSH->PORT_STATUS & USBHS_UHIS_PORT_CONNECT)  == 0x00){
				USBHSH->PORT_STATUS_CHG = 0xff;																		   // Clear Port Status
				gDeviceUsbType = 0x00;
				gDeviceConnectstatus = 0x00;
				printf("USB2.0 DEVICE DISCONNECT !\n");
			}
		}
	    mDelaymS(1000); 
	}
	USBHSH->DEV_ADDR = 0x00;
	len = 8;
	status = U20HOST_GetDeviceDescr( pbuf, &len );
	if( status != USB_INT_SUCCESS ){
		printf("GetDev_ERROR=%02x\n", status );
		return USB_OPERATE_ERROR;
	}
	UsbDevEndp0Size = *(pbuf+7);
	printf("UsbDevEndp0Size=%02x\n",UsbDevEndp0Size);
	mDelaymS(1);
	status = U20HOST_SetAddress( DEVICE_ADDR );
	if( status != USB_INT_SUCCESS ){
		printf("SetAddr_ERROR=%02x\n", status );
		return USB_OPERATE_ERROR;
	}
	len = 0x12;
	status = U20HOST_GetDeviceDescr( pbuf, &len );
	if( status != USB_INT_SUCCESS ){
		printf("GetDev_ERROR=%02x\n", status );
		return USB_OPERATE_ERROR;
	}
	status = U20HOST_GetConfigDescr( pbuf, &len );
	if( status != USB_INT_SUCCESS ){
		printf("GetDev_ERROR=%02x\n", status );
		return USB_OPERATE_ERROR;
	}
	cfg = ( (PUSB_CFG_DESCR)pbuf ) -> bConfigurationValue;
	printf("cfg=%02x\n",cfg);
	printf("ConfigDescr:");
	for( i=0;i!=len;i++ ){
		printf("%02x ",*(pbuf+i));
	}
	printf("\n");
	status=U20HOST_CofDescrAnalyse( pbuf );
	if( status != USB_INT_SUCCESS )
	{
		printf( "Current Device is Not USB Mass Storage Device\n" );
		return( USB_OPERATE_ERROR ); 		 																		   // Return directly
	}
	status = U20HOST_MS_CofDescrAnalyse( pbuf );
	status = U20HOST_SetConfig( cfg ); 																				   // USB Host Set Configuration
	if ( status != USB_INT_SUCCESS )
	{
		printf( "SetConfig_ERROR = %02X\n", (UINT16) status );
		return( USB_OPERATE_ERROR ); 		 																		   // Return directly
	}
	return status;
}

